---
kind: property
id: P:Autodesk.Revit.DB.SiteLocation.PlaceName
source: html/9a34156b-1fee-402a-01d2-8489132245c2.htm
---
# Autodesk.Revit.DB.SiteLocation.PlaceName Property

The place name of the site.

## Syntax (C#)
```csharp
public string PlaceName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null